[{"name": "Pedro Pascal", "role": "Actor", "info": "Pedro Pascal is a Chilean-born actor. He is best known for portraying the roles of Oberyn Martell in the fourth season of the HBO series Hra o trůny (2011), Javier Peña in the Netflix series Narcos (2015), the titular character in the Disney+ series Mandalorian (2019) and Joel Miller in the ...", "url": "https://www.imdb.com/name/nm0050959"}, 
{"name": "Tom Sizemore", "role": "Actor", "info": "Tom Sizemore rose in prominence throughout the 1990s, establishing himself as a memorable tough-guy actor, sought by the most respected directors in the business.Thomas Edward Sizemore, Jr. was born in Detroit, Michigan, to Judith (Schannault), an ombudsman staff member, and Thomas Edward Sizemore, ...", "url": "https://www.imdb.com/name/nm0001744"}, 
{"name": "Bella Ramsey", "role": "Actress", "info": "Bella Ramsey made their professional acting debut as fierce young noblewoman Lyanna Mormont in Season 6 of HBO's 'Game of Thrones', a role that quickly became a fan favorite and saw Bella return for the next 2 seasons. Bella will be returning to HBO as the leading role of 'Ellie Williams' in their ...", "url": "https://www.imdb.com/name/nm8165602"}, 
{"name": "Storm Reid", "role": "Actress", "info": "Storm Reid has known she wanted to be an actress since she was just three years old. She landed her first feature film role opposite Chiwetel Ejiofor, Michael Fassbender, Brad Pitt, and Paul Giamatti in the Academy Award winning film 12 let v řetězech (2013) directed by Steve McQueen for ...", "url": "https://www.imdb.com/name/nm4977564"}, 
{"name": "Madelyn Cline", "role": "Actress", "info": "Originally from Charleston, South Carolina, Madelyn spent her summers in New York working on TV commercials and print ads for clients such as Next, T-mobile and Sunny D.Madelyn is known for her leading and supporting roles such as Chloe in Boy Erased and Taylor Watts in HBO's Vice Principals.", "url": "https://www.imdb.com/name/nm3218692"}, 
{"name": "Brendan Fraser", "role": "Actor", "info": "Brendan James Fraser was born in Indianapolis, Indiana, to Canadian parents Carol Mary (Genereux), a sales counselor, and Peter Fraser, a journalist and travel executive. He is of Irish, Scottish, German, Czech, and French-Canadian ancestry. As his parents frequently moved, Brendan can claim ...", "url": "https://www.imdb.com/name/nm0000409"}, 
{"name": "Jenna Ortega", "role": "Actress", "info": "Jenna Marie Ortega was born on September 27, 2002 in Coachella Valley, California. She began acting at age 9 and has portrayed Harley, a creative-engineering prodigy navigating life as the middle child in a family of 7 children in Stuck in the Middle, a Disney Channel series told from Harley's ...", "url": "https://www.imdb.com/name/nm4911194"}, 
{"name": "Aubrey Plaza", "role": "Actress", "info": "Aubrey Christina Plaza (born June 26, 1984) is an American actress and comedian known for her deadpan style. She portrayed April Ludgate on Parks and Recreation (2009), and after appearing in supporting roles in several films, had her first leading role in the 2012 comedy Safety Not Guaranteed (...", "url": "https://www.imdb.com/name/nm2201555"}, 
{"name": "Riley Keough", "role": "Actress", "info": "Actress and model Danielle Riley Keough was born in Santa Monica, California, to musicians Lisa Marie Presley and Danny Keough. She is the eldest grandchild of legendary singer Elvis Presley and actress Priscilla Presley. Keough started modeling as a teenager. Her first appearance was on a runway ...", "url": "https://www.imdb.com/name/nm2142336"}, 
{"name": "Elizabeth Banks", "role": "Actress", "info": "Elizabeth Banks was born Elizabeth Mitchell in Pittsfield, a small city in the Berkshires in western Massachusetts near the New York border, on February 10, 1974. She is the daughter of Anne Marie (Wallace), who worked in a bank, and Mark Phineas Mitchell, a factory worker. Elizabeth describes ...", "url": "https://www.imdb.com/name/nm0006969"}, 
{"name": "Emily Swallow", "role": "Actress", "info": "Emily Rebecca Swallow was born in Washington, DC and grew up in Sterling, VA and Jacksonville, FL.She earned a BA in Middle Eastern Studies at the University of Virginia and interned at the State Department, but an acting teacher at UVA noticed her passion and talent for acting and singing and ...", "url": "https://www.imdb.com/name/nm2646861"}, 
{"name": "Brandon Sklenar", "role": "Actor", "info": "Brandon Sklenar was born and raised in northern New Jersey. His father a carpenter and his mother a hair dresser. With an intense passion for both film and music, at a young age he decided to pursue a career as an actor and filmmaker.In 2018 Brandon worked with revered international filmmaker Amir ...", "url": "https://www.imdb.com/name/nm3996999"}, 
{"name": "Jonathan Majors", "role": "Actor", "info": "Jonathan graduated from the Yale School of Drama with an MFA in acting. Jonathan is a recipient of the National Society of Arts and Letters (NSAL) National Drama Competition. Jonathan made his screen debut starring in the ABC miniseries When We Rise and has since landed strong roles, cementing ...", "url": "https://www.imdb.com/name/nm3718007"}, 
{"name": "Matilda De Angelis", "role": "Actress", "info": "Matilda De Angelis is an Italian actress and singer. Her credits include the films Italian Race and Rose Island, and the television miniseries The Undoing. She started playing guitar and violin at the age of thirteen. She attended the lice scientific Enrico Fermi in Bologna. In 2011, De Angelis ...", "url": "https://www.imdb.com/name/nm7006860"}, 
{"name": "Katee Sackhoff", "role": "Actress", "info": "Kathryn Ann Katee Sackhoff (born April 8, 1980) is an American actress known for playing Lieutenant Kara Starbuck Thrace on the Sci Fi Channel's television program Battlestar Galactica (2004-2009). She was nominated for four Saturn Awards for her work on Battlestar Galactica and won the award ...", "url": "https://www.imdb.com/name/nm0755267"}, 
{"name": "Anna Osceola", "role": "Actress", "info": "Anna Osceola was born on April 8, 1988 in Cambridge, Massachusetts, USA. She is an actress, known for Confess, Fletch (2022), Šílenci z Manhattanu (2007) and Zákon a porádek: Útvar pro zvlástní obeti (1999).", "url": "https://www.imdb.com/name/nm2443416"}, 
{"name": "Julia Schlaepfer", "role": "Actress", "info": "Julia Schlaepfer was born on March 3, 1995. She is an actress, known for 1923 (2022), The Politician (2019) and The Sky Is Everywhere (2022).", "url": "https://www.imdb.com/name/nm7879234"}, 
{"name": "Lindsey Morgan", "role": "Actress", "info": "As one of the most popular up and coming Latina actresses in the business, Lindsey Morgan has built an extensive resume between her work in television and film. She currently stars as series regular, Raven Reyes, on The CW's popular scifi drama The 100.Born in Georgia, and raised in Texas, this ...", "url": "https://www.imdb.com/name/nm4289392"}, 
{"name": "Chase Stokes", "role": "Actor", "info": "Chase Stokes was born on September 16, 1992 in Annapolis, Maryland, USA. He is an actor, known for Outer Banks (2020), One of Us Is Lying (2021) and Stranger Things (2016).", "url": "https://www.imdb.com/name/nm6795924"}, 
{"name": "Anna Torv", "role": "Actress", "info": "Anna Torv (born 7 June 1979) is an Australian actress known for her role as FBI agent Olivia Dunham on the Fox television series Fringe (2008-2013). Torv was born in Melbourne, Victoria, the daughter of Susan (née Carmichael) and Hans Torv, also grew up in Gold Coast, Queensland. Her father is of ...", "url": "https://www.imdb.com/name/nm1396022"}, 
{"name": "Alexandra Daddario", "role": "Actress", "info": "Alexandra Anna Daddario was born on March 16, 1986 in New York City, New York, to Christina, a lawyer, and Richard Daddario, a prosecutor. Her brother is actor Matthew Daddario, her sister is actor Catharine Daddario, and her grandfather was congressman Emilio Daddario (Emilio Q. Daddario), of ...", "url": "https://www.imdb.com/name/nm1275259"}, 
{"name": "Natasha Lyonne", "role": "Actress", "info": "Natasha Lyonne is an Emmy- and Golden Globe-nominated producer, actor, writer, and director.Lyonne co-created Netflix series Ruská panenka (2019), which received three Emmy awards, a total of 13 Emmy nominations including Comedy Series and Lead Actress for Lyonne, a Gotham Award nomination, ...", "url": "https://www.imdb.com/name/nm0005169"}, 
{"name": "Teresa Palmer", "role": "Actress", "info": "Actress and model Teresa Palmer has gathered some impressive film credits. She was born in Adelaide, South Australia, to Kevin Palmer, an investor, and Paula Sanders, a former missionary and nurse. She completed high school at Mercedes College in 2003, where she was a popular student who was ...", "url": "https://www.imdb.com/name/nm1954240"}, 
{"name": "Nathalie Emmanuel", "role": "Actress", "info": "Nathalie Emmanuel is an English actress, known for her role as Missandei on the HBO fantasy series Hra o trůny (2011) and Ramsey in Rychle a zběsile 7 (2015).Nathalie was born in Southend-on-Sea, Essex, England, to a father of Saint Lucian and English descent and a mother of Dominican ...", "url": "https://www.imdb.com/name/nm2812026"}, 
{"name": "Ashley Johnson", "role": "Actress", "info": "Los Angeles-based Ashley Suzanne Johnson was born in Camarillo, California on August 9, 1983, to Clifford and Nancy Johnson. She is of Danish, Irish, Native American, Norwegian, Scottish, and Swedish descent. When she was 9 days old, her family packed up and moved to Michigan where her father (the ...", "url": "https://www.imdb.com/name/nm0424534"}, 
{"name": "Ginger Gonzaga", "role": "Actress", "info": "Ginger is an improviser, actor, writer, and director.In television, Ginger is best known for her role as Christy on the Duplass Brothers' critical darling Togetherness (2015) on HBO, Maggie on Showtime's Dramedy I'm Dying Up Here (2017), Peggy of FX's Legit (2013), and Lorena on Hulu's drama ...", "url": "https://www.imdb.com/name/nm2668086"}, 
{"name": "Tom Cruise", "role": "Actor", "info": "In 1976, if you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would be Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. ...", "url": "https://www.imdb.com/name/nm0000129"}, 
{"name": "Kathryn Newton", "role": "Actress", "info": "Kathryn co-starred as Cassie Lang in Ant-Man and the Wasp: Quantumania 2023, followed by Lisa Frankenstein starring alongside Cole Sprouse and Winner starring Emilia Jones, with release dates sometime in 2023. She can be seen as the lead of Amazon's The Map of Tiny Perfect Things, on Prime Video. ...", "url": "https://www.imdb.com/name/nm1105980"}, 
{"name": "Annie Wersching", "role": "Actress", "info": "This talented actress was born Anne Marie Wersching and grew up in St. Louis, Missouri. She opted early on for a life in the entertainment industry, performing in community theatre and later as a dancer for some fourteen years with a troupe called the St. Louis Celtic Stepdancers. After moving to ...", "url": "https://www.imdb.com/name/nm1156709"}, 
{"name": "Brittany O'Grady", "role": "Actress", "info": "Brittany O'Grady has been performing professionally since the age of 4. Most recently, Brittany appeared as Paula in 'The White Lotus', Mike White's dark comedy mini-series for HBO. Brittany also starred in 'Little Voice' on Apple TV+, in which she portrayed Bess King, a young aspiring ...", "url": "https://www.imdb.com/name/nm6239256"}, 
{"name": "Isabel May", "role": "Actress", "info": "Isabel May is an American actress. She starred as Katie Cooper on the Netflix series Alexa & Katie and had a recurring role as Veronica Duncan on the CBS series Young Sheldon. She held the lead role of Zoe Hull in film Run Hide Fight. She is the narrator and leading protagonist of the Paramount+ ...", "url": "https://www.imdb.com/name/nm8908475"}, 
{"name": "Melanie Lynskey", "role": "Actress", "info": "At 16 years of age, Melanie Lynskey captivated filmgoers with an astonishing debut in Peter Jackson's revered psychological crime picture, Heavenly Creatures (1994). Her bold embodiment of the real-life Pauline Parker - a teenage outcast whose fierce bond with her only friend (a pre-stardom Kate ...", "url": "https://www.imdb.com/name/nm0001491"}, 
{"name": "Michelle Yeoh", "role": "Actress", "info": "Michelle Yeoh was born in Ipoh, Malaysia. She's the daughter of Janet Yeoh & Kian Teik Yeoh. She's of Hokkien descent, speaking English and Malay before Chinese. A ballet dancer since 4, she moved to London to study at the Royal Academy as a teen. After a brief dance career, she won the Miss ...", "url": "https://www.imdb.com/name/nm0000706"}, 
{"name": "Kate Mara", "role": "Actress", "info": "Kate Mara is an American actress. She starred in the Netflix political drama Dům z karet (2013) as Zoe Barnes and appeared in the Fox TV series 24 hodin (2001) as computer analyst Shari Rothenberg. She appeared in Zkrocená hora (2005), We Are Marshall (2006), Odstřelovač (2007)...", "url": "https://www.imdb.com/name/nm0544718"}, 
{"name": "Evangeline Lilly", "role": "Actress", "info": "Evangeline Lilly, born in Fort Saskatchewan, Alberta, in 1979, was discovered on the streets of Kelowna, British Columbia, by the famous Ford modeling agency. Although she initially decided to pass on a modeling career, she went ahead and signed with Ford anyway, to help pay for her University of ...", "url": "https://www.imdb.com/name/nm1431940"}, 
{"name": "Cara Delevingne", "role": "Actress", "info": "Cara Jocelyn Delevingne was born in London, England, to Pandora Anne (Stevens) and Charles Hamar Delevingne, a property developer. Her parents are both from prominent upper-class families, with her ancestors including Viscounts (Greenwood), Baronets (Hulton, Faudel-Phillips), Majors and Lord Mayors...", "url": "https://www.imdb.com/name/nm5353321"}, 
{"name": "Lizzy Caplan", "role": "Actress", "info": "Actress Elizabeth Anne Lizzy Caplan was born in Los Angeles, California, to Barbara (Bragman), a political aide, and Richard Caplan, a lawyer. She has two older siblings, Julie and Benjamin, and was raised in a Jewish household. Her mother was a cousin of publicist Howard Bragman. Caplan was ...", "url": "https://www.imdb.com/name/nm0135221"}, 
{"name": "Nicolas Cage", "role": "Actor", "info": "Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish and German (mother) descent. Cage changed his...", "url": "https://www.imdb.com/name/nm0000115"}, 
{"name": "Madison Bailey", "role": "Actress", "info": "Madison Bailey was born on January 29, 1999 in North Carolina, USA. She is an actress, known for Outer Banks (2020), Černý blesk (2017) and Creepshow (2019).", "url": "https://www.imdb.com/name/nm6045536"}, 
{"name": "Bryce Dallas Howard", "role": "Actress", "info": "Bryce Dallas Howard was born on March 2, 1981, in Los Angeles, California. She was conceived in Dallas, Texas (the reason for her middle name). Her father, Ron Howard, is a former actor turned Oscar-winning director. Her mother is actress and writer Cheryl Howard (née Alley). Her famous relatives ...", "url": "https://www.imdb.com/name/nm0397171"}, 
{"name": "Christa Miller", "role": "Actress", "info": "Christa Miller was introduced to the entertainment world at a very young age. As a toddler, she was photographed by the acclaimed Francesco Scavullo for an Ivory Snow ad with her mother, and, at the age of three, appeared on the cover of Redbook. Miller was bitten by the acting bug as a child, ...", "url": "https://www.imdb.com/name/nm0588096"}, 
{"name": "Sam Claflin", "role": "Actor", "info": "English actor Sam Claflin was born in Ipswich, England, to Susan A. (Clarke), a classroom assistant, and Mark J. Claflin, a finance officer. As a child, he was football-mad, often going to see his favorite team, Norwich City. He was a talented footballer, playing for Norwich schools at city level ...", "url": "https://www.imdb.com/name/nm3510471"}, 
{"name": "Austin Butler", "role": "Actor", "info": "Austin Robert Butler was born in Anaheim, California, to Lori Anne (Howell), an aesthetician, and David Butler. He has always enjoyed movies of all types. When he was 13 he was walking around at the Orange County Fair and was approached by a representative from a background-acting management ...", "url": "https://www.imdb.com/name/nm2581521"}, 
{"name": "Michael B. Jordan", "role": "Actor", "info": "Michael B. Jordan, the middle of three children, was born in Santa Ana, California and raised in Newark, New Jersey. He is the son of Donna (Davis), a high school counselor, and Michael A. Jordan. His middle name, Bakari, means noble promise in Swahili. (He is not related to, or named after, ...", "url": "https://www.imdb.com/name/nm0430107"}, 
{"name": "Jahi Di'Allo Winston", "role": "Actor", "info": "Jahi Di'Allo Winston was born on November 30, 2003 in Atlanta, Georgia USA. He is an actor, known for Queen & Slim (2019), Mrtví neumírají (2019) and Nedotknutelní (2017).", "url": "https://www.imdb.com/name/nm8091769"}, 
{"name": "Amanda Plummer", "role": "Actress", "info": "The daughter of Canadian actor Christopher Plummer and American actress Tammy Grimes, Amanda Plummer was born in New York City on March 23, 1957. Her breakthrough role came when she starred opposite Robin Williams in The Fisher King (1991). However, Plummer may be best remembered for her work in the...", "url": "https://www.imdb.com/name/nm0001625"}, 
{"name": "Mia Goth", "role": "Actress", "info": "Mia Gypsy Mello da Silva Goth was born October 25, 1993 in Southwark, London, England to a Brazilian mother and a Canadian father. Goth moved to Brazil when she was a few weeks old and returned to Britain when she was five. She later briefly relocated to her father's native Canada when she was ten....", "url": "https://www.imdb.com/name/nm5301405"}, 
{"name": "David Harbour", "role": "Actor", "info": "David Harbour is an American actor who has performed in film, television, and the theater.He is known for his role as CIA agent Gregg Beam in Quantum of Solace (2008), Shep Campbell in Nouzový východ (2008), Van Hauser in End of Watch (2012) and Dexter Tolliver in Sebevražedn&...", "url": "https://www.imdb.com/name/nm1092086"}, 
{"name": "Jennifer Coolidge", "role": "Actress", "info": "Jennifer Coolidge is a versatile character actress and experimental comedienne, best known for playing Stifler's mom in Prci, prci, prcičky (1999).She was born on August 28, 1961, in Boston, Massachusetts, USA, to Gretchen (Knauff) and Paul Constant Coolidge, a plastics manufacturer. Young ...", "url": "https://www.imdb.com/name/nm0177639"}, 
{"name": "Steve Howey", "role": "Actor", "info": "From nuanced and honest portrayals of fatherhood-gone-wild across the eighth season of Showtime's EMMY® Award-nominated series Shameless to palpable intensity on the likes of Sons of Anarchy, Steve Howey reflects a classic masculinity on-screen equally steeped in humor and heart. That timeless ...", "url": "https://www.imdb.com/name/nm0992538"} ]